---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisCurrentViewOnly
source: html/64f51273-dd74-00b8-9528-bdfc87f61cb6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisCurrentViewOnly Property

"Use Only Elements Visible In Current View"

## Syntax (C#)
```csharp
public static ForgeTypeId EnergyAnalysisCurrentViewOnly { get; }
```